Revit 2024 API
CompoundStructure.GetRegionsAlongLevel Method
 Returns the ids of the regions encountered as the vertically compound structure is traversed at a constant height above the bottom a wall to which this structure is applied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<int> GetRegionsAlongLevel(
	double height
)
Visual Basic
Public Function GetRegionsAlongLevel ( _
	height As Double _
) As IList(Of Integer)
Visual C++
public:
IList<int>^ GetRegionsAlongLevel(
	double height
)
Parameters
height
Type: System.Double
 Distance from the bottom of the wall.
Return Value
 The ids of the regions intersected by the specified line.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The height is outside valid range. It should be in the range of [0, SampleHeight].
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace